{"title": "BIT Magazine | CodeChef", "time-limit": 214, "memory-limit": -1, "props": {"Problem code": "  TRMAG ", "Note": " The magazine ", "Input": " \n2", "Output": " \n31.2000", "Author": " \n 2", "Tester": " \n 1", "Date Added": " \n 29", "Time Limit": " \n 0.214493 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Taru likes reading. Every month he gets a copy of the magazine \"BIT\". The magazine contains information about the latest advancements in technology.  Taru  reads the book at night and writes the page number to which he has read on a piece of paper so that he can continue from there the next day. But sometimes  the page number is not printed or is so dull that it is unreadable.  To make matters worse Taru's brother who is really naughty tears of some of the pages of  the Magazine and throws them in the dustbin. He remembers the number of leaves he had torn but he does not remember which page numbers got removed. When Taru  finds this out he is furious and wants to beat him up. His brother apologizes, and says he won't ever do this again. But Taru did not want to be easy on him  and he says \"I will leave you only if you help me find the answer to this. I will tell you how many pages (Printed sides) were there in the Magazine plus the  pages on which the page numbers were not printed. You already know the number of leaves you tore (T). Can you tell me the expected sum of the page numbers  left in the Magazine?\" Taru's brother replied \"huh!! This is a coding problem\". Please help Taru's brother.\n \nNote: The magazine is like a standard book with all odd page numbers in front and the successive even page number on its back. If the book contains 6 pages,  Page number 1 and Page number 2 are front and back respectively. Tearing a leaf removes both the front and back page numbers. The first line contains the number of test cases t. 3t lines follow. The first line of each test case contains the number of pages (printed sides) in the  book. The second line's first integer is F, F integers follow which tell us the numbers of the page numbers not printed. The third line contains a single integer telling us the number of leaves Taru's brother tore. Output one real number correct up to 4 decimal digits which is equal to the expected sum of the page numbers left in the book. \nNumber of printed Sides<=2000. All other values abide by the number of printed sides.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}