{"title": "Dee and Tweedle", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  TWEED ", "Input": " \n1", "Output": " \nDum", "Author": " \n 6", "Tester": " \n 6", "Date Added": " \n 21", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Tweedle-Dee and Tweedle-Dum are in a fierce battle playing even-odd nim. This novel game is played on  N  heaps. Heap  i  contains  a i  stones.\n Like normal nim, Tweedle-Dee and Tweedle-Dum alternate taking a positive number of stones from any single one of the heaps, and the player that can't remove stones loses. However Tweedle-Dee can only take an even number of stones, and Tweedle-Dum can only take an odd number of stones. Alice doesn't want to wait until the end of the game, so she asks you to determine the winner of the game. Remember that Tweedle-Dee and Tweedle-Dum are legendary grandmasters of combinatorial games, so they always play optimally. The first line of the input contains an integer  T  denoting the number of test cases. The description of  T  test cases follows. The first line of each case consists of an integer  N  the number of heaps, and a string  P  the player that starts the game. String  P  is equal to \"Dee\" if Tweedle-Dee goes first, or \"Dum\" if  Tweedle-Dum goes first. The second line of each case contains  N  space separated integers  a i  the number of stones of the i-th heap. For each test case, output a single line containing either \"Dee\" if Twedle-Dee winns the game or \"Dum\" otherwise. Tweedle-Dee takes two stones from any of the heaps leaving just one non empty heap, next Tweedle-Dum takes one stone and the game finishes.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}