{"title": "Chef and Two String | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  CHEFTWOS ", "Input": " \n2", "Output": " \n8", "Author": " \n berezin ", "Tester": " \n 7", "Date Added": " \n 11", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Chef's loves his dog so much! Once his dog created two strings  a  and  b  each of length  n  consisting of digits  1  and  2 , and even a problem about them! Chef's Dog will tell by barking if a string  x  (also containing only digits  1  and  2  and with length  N ) is  good  or not by performing the following actions.\n \n It starts at first digit of the string, i.e. at  i = 1 .  \n It can move from digit  i  to either  i - 1  or  i + 1  if  x i  equals  1  and the corresponding digits exist.  \n It can move from digit  i  to either  i - 2  or  i + 2  if  x i  equals  2  and the corresponding digits exist.  \n It  must  visit each digit  exactly  once.  \n It  must  finish at the last digit ( X N ).  \n \n Chef's dog wants to make both the strings  a  and  b   good  by choosing some subset  S  (possibly empty) of indices of set  {1, 2, ..., n}  and swapping each index  i ϵ S  between string  a  and  b , i.e. swapping  a i  and  b i . Can you find how many such subsets  S  exist out there? As the answer could be large, output it modulo  10 9  + 7 . The first line of the input contains an integer  T  denoting the number of test cases. The description of  T  test cases follows. The first line contains string  a . The second line contains string  b . For each test case, output a single line containing answer of the problem. Test case 1. \nPossible subsets are: \n {} ,  {1, 2} ,  {1, 2, 3} ,  {1, 2, 4} ,  {1, 2, 3, 4} ,  {3} ,  {4} ,  {3, 4} .\n Test case 2.  There are no possible sets  S  which can make both the strings good.\n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}