{"title": "Chef and Trees | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  MAXDIST ", "challenging problem": " Can we ", "Input": " \n3", "Output": " \nNO", "Author": " \n 6", "Date Added": " \n 8", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "\nChef recently read about trees. He already learnt that the trees are undirected, simple, connected graphs and has no cycles. He also knows that the tree (or graph) diameter is the largest distance of two nodes in the tree (or graph). He finds out about a challenging problem: Can we decrease the diameter of the tree if we add just a single edge? Unfortunately he is tired from a lot of reading, so could you help him to solve the problem?\n\n  The first line of the input contains an integer  T , denoting the number of test cases. \nThe description of  T  test cases follows. The first line of each test contains an integer  N , denoting the number of nodes in the tree.\nThe next  N - 1  lines contain two space separated integers  A i , B i  denoting the tree edges.\nIt's guaranteed that the input is a valid tree.\n   \nFor each test case, output a single line print \"YES\" if it is possible to add a tree an edge to decrease the diameter of the graph, otherwise print \"NO\".\n     Example case 1.  \nIn this example, we can use just cycle edges, or a parallel edge but these edges don't change the distance of the 1-2 nodes.\n \n Example case 2. \nThe original graph diameter is two because distance(1,3)=2, distance(1,2)=1 and distance(2,3)=1, if we connect 1,3 nodes then distance(1,3) will be 1 so the diameter decrease to 1.\n \n Example case 3. \nThe original graph diameter is three because dist(1,4)=dist(1,5)=3, if we connect 1,3 nodes then the diameter becomes 2.\n \n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}