{"title": "Chef and Employment Test | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  CK87MEDI ", "Input": " \n3", "Output": " \n7", "Author": " \n saeed", "Tester": " \n 6", "Date Added": " \n 19", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Even though it was a little unexpected, Chef did it! He has finally opened a new restaurant! As you all know, to make everything go well, Chef needs employees (co-chefs if you might say). Because Chef is a perfectionist, he planned to employ only chefs who are good at competitive progeamming. Hence, Chef asked for help from his friends Shahhoud and Said. Knowing that many people (such as Ahmad, Nour, Majd and Joud) will apply for the job, they decided to choose only the best appliers. As the day of the employment came, people lined up in front of the restaurant applying for the job. Before accepting any appliers, Shahhoud and Said decided to make them answer a simple question, in order to determine which of them better deserves the job. Given an array of  N  elements  A 1 , A 2 , ..., A N , each applier was asked to insert any  K  integers he wants to this array. Eventually, each applier will be asked to write down the median among all the elements in his resulting array. Many appliers asked for your help to determine what is the greatest median they can get after inserting any  K  elements they want? Note that the median in an array is the element positioned at the center of the array after sorting it. E.g. the median in  [2, 1, 5, 2, 4]  is  2 , and the median in  [3, 3, 1, 3, 3]  is  3 .   The first line of the input contains an integer  T  denoting the number of test cases. The first line of each test case contains two space separated integers  N  and  K  denoting the array length, and the number of elements to be inserted. The second line of each test case contains  N  space separated integers  A 1 ,  A 2 ,  ... ,  A N  denoting the elements of the array. For each test case output a single line, containing a single integer, indicating the greatest median the applier can obtain after inserting exactly  K  new elements into the given array.     Example case 1.  One of the possible solutions is to add  9  making the array  [4, 7, 9] , whose median is  7 Example case 3.  No matter what elements you add to this array, the median will always be  1    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}