{"title": "Who dares to be a millionaire | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  WDTBAM ", "are determined": "  W 0 ", "Input": " \n3", "Output": " \n30", "in order": "  2 nd ", "Author": " \n 5", "Date Added": " \n 20", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Chef is going to participate in a new quiz show: \"Who dares to be a millionaire?\" According to the rules of the game, contestants must answer  N  questions. The quiz being famous for its difficulty, each question has  26  candidate answers, but only one of which is correct. Answers are denoted by capital Latin letters from A to Z. Chef knows all the questions that can be asked, and for each of them he knows the answer candidate he will choose (some of them can be incorrect). For each question, we'll tell you Chef's answer to it. Chef is interested in finding the maximum possible winnings that he can amass. The first line of input contains an integer  T  denoting the number of test cases. The  description of  T  test cases follows. The first line of each test case contains a single integer  N  denoting the number of questions. Next line contains  N  capital Latin letters denoting the correct answers to these questions. Next line contains  N  capital Latin letters denoting answers given by Chef to these questions. Next line contains  N + 1  space-separated integers  W 0 ,  W 1 , ...,  W N  denoting the winnings for  0 ,  1 , ...,  N  correct answers. For each test case, output a single line containing the value of maximum possible winnings that Chef can get. Subtask 1: (20 points) Subtask 2: (80 points) Example case 1.  If questions will be placed in order:  2 nd  (Chef's answer is B, which is correct),  3 rd  (Chef's answer is C, and it is correct as well),  4 th  (Chef's answer is D, and he is right),  5 th  (Chef's answer is A but correct answer is E and the game is over),  1 st , Chef will correctly answer  3  questions, and therefore win  30  dollars. Example case 2.  Chef's answers for all questions are incorrect, so his winnings are  W 0  dollars. Example case 3.  Since all  W i  are equal to  100  dollars, Chef will win this sum in any possible case.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}