{"title": "Ambiguous Permutations | CodeChef", "time-limit": 9420, "memory-limit": -1, "props": {"Problem code": "  PERMUT2 ", "really tricky": " not only ", "a permutation": " \nYou create ", "Author": " \n admin ", "Date Added": " \n 1", "Time Limit": " \n 9.42 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "\nSome programming contest problems are really tricky: not only do they \nrequire a different output format from what you might have expected, but \nalso the sample output does not show the difference. For an example, \nlet us look at permutations. \nA  permutation  of the integers  1  to  n  is an \nordering of \nthese integers. So the natural way to represent a permutation is \nto list the integers in this order. With  n = 5 , a \npermutation might look like 2, 3, 4, 5, 1.  \nHowever, there is another possibility of representing a permutation: \nYou create a list of numbers where the  i -th number is the \nposition of the integer  i  in the permutation. \nLet us call this second \npossibility an  inverse permutation . The inverse permutation \nfor the sequence above is 5, 1, 2, 3, 4. \n \nAn  ambiguous permutation  is a permutation which cannot be \ndistinguished from its inverse permutation. The permutation 1, 4, 3, 2 \nfor example is ambiguous, because its inverse permutation is the same. \nTo get rid of such annoying sample test cases, you have to write a \nprogram which detects if a given permutation is ambiguous or not.\n The input contains several test cases. \nThe first line of each test case contains an integer  n \n( 1 ≤ n ≤ 100000 ). \nThen a permutation of the integers  1  to  n  follows \nin the next line. There is exactly one space character \nbetween consecutive integers. \nYou can assume that every integer between  1  and  n \nappears exactly once in the permutation. \n \nThe last test case is followed by a zero.\n For each test case output whether the permutation is ambiguous or not. \nAdhere to the format shown in the sample output.\n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}