{"title": "Dish Distribution | CodeChef", "time-limit": 244, "memory-limit": -1, "props": {"Problem code": "  DISHDIS ", "be simple": " Tell him ", "Input": " \n First line ", "separated integers": " n and ", "Output": " \n For every ", "single integer": " the number ", "Constraints": " \n 1", "Example": " \n Input ", "Explanation": " \nThe chef ", "Author": " \n 3", "Tester": " \n 2", "Date Added": " \n 2", "Time Limit": " \n 0.244444 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Chef feels that being the Head Chef is a very difficult job. More than cooking, managing the kitchen and distributing the work between various cooks proves to be a tiring task. There are many dishes to be prepared. And he has a team of talented cooks to do this for him. But the Chef always has a problem distributing tasks among them. For a cook i, the Chef wants to give him  atleast  xi dishes to prepare in a day. But different cooks have different capacities. Any cook i can cook  atmost  yi number of dishes in a single day. Chef is very aware of every cook's capability and will not give anyone more work than his maximum capacity. Now, he wants you to help him out here.  Your task will be simple: Tell him the number of ways in which he can distribute the given number of dishes among his team. First line contains T, number of tests. \nEach test begins with a single line containing 2 space separated integers: n and m, the number of dishes to be prepared and the number of cooks in Chef's team. \nThen follow m lines. The ith line contains 2 space separater integers which are the corresponding xi and yi. For every test case, output a single integer: the number of ways of distributing the work mod 1000000007. 1<=T<=50 \n1<=n,m<=100 \n0<=xi,yi<=100 Input \n1 \n3 2 \n0 3 \n1 3 Output \n3 Explanation: \nThe chef can distribute the dishes in the following ways- 0 and 3 ; 1 and 2 ; 2 and 1 .    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}