{"title": "Chef and sequence | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  UASEQ ", "Input": " \n4 2", "Author": " \n 4", "Tester": " \n 6", "Date Added": " \n 24", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "        You are given an array that consists of  n  integer numbers. You have to change at most  K  elements of this array, so that the resulting array will be a arithmetic progression. From all the possible arithmetic progressions, you should choose most  beautiful .  You can uniquely define the arithmetic progression by two numbers  a 0  and  d  - the first element of the given progression and the step that defines next element. ( a i  = a 0 +i * d ). The progression  A(a 0  , d 0 )  is more  beautiful  than the progression  B(b 0 , d 1 )  iff  (a 0  < b 0  or (a 0  = b 0  and d 0  < d 1 ))     The first line contains two integers  N  and  K  denoting the number of elements in the given array and the number of elements that you can change The second line contains  N  space-separated integers  A 1 ,  A 2 , ...,  A N  denoting the given array. Output a single line containing the resulting array with at most  K  changes. Mind that among all the arithmetic sequences you have to choose the most  beautiful .\n In the given test data, it is always possible to recover at least one arithmetic progression under the constraints of the problem.        Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}