{"title": "Extreme Encoding | CodeChef", "time-limit": 2000, "memory-limit": -1, "props": {"Problem code": "  KOL16B ", "into one": "\n \n\nint encodeInteger", "Author": " \n kol", "Date Added": " \n 21", "Time Limit": " \n 2 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n C", "now is": "  \n Your IP"}, "statement": "Lajuk is a little girl who loves playing with array. In her 10th birthday, she got two arrays as presents. Let’s call them  A  and  B . Both arrays have the same size  n  and contains integers between  0  to  30000 . Lajuk’s hard-drive is almost full of presents and she barely has any space to keep the arrays. She discovered a brilliant function to merge the array into one:\n \n\nint encodeInteger(int x, int n){\n\tn = n<<(1<<(1<<(1<<1)));\n\tx = x | n;\n\treturn x;\n}\nvoid encodeArray(int *A, int *B, int n){\n\tfor(int i=0;i<n;i++) {\n    \t    A[i] = encodeInteger(A[i], B[i]);\n\t}\n}\n \n Lajuk passed  A  and  B  into the encodeArray function. After that she discarded array  B  and saved the modified version of array  A  in the hard-drive.  Now in her 15th birthday Lajuk wants to play with those arrays again. She found the modified version of array A in the hard-drive but she forgot how to recover the original arrays from it. Being upset, she asked for your help. Can you help her to recover the original arrays? The first line contains  T (1 ≤ T ≤ 100) , the number of test cases. The first line of each test cases contains  n (1 ≤  n ≤  10 4 ) , the size of the array. Next  n  line contains  n  integers denoting the modified array  A . For each case print the case number in the first line. In the second line, print n integers denoting the original array  A . In the third line print n integers denoting the array  B . Two consecutive  integers should be separated by a single space.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}