{"title": "Little Chef and Sums | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  CHEFSUM ", "Input": " \n2", "Output": " \n1", "Author": " \n 5", "Tester": " \n jingbo", "Date Added": " \n 27", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "\nOur little chef is fond of doing additions/sums in his free time. Today, he has an array  A  consisting of  N  positive integers and he will compute prefix and suffix sums over this array. He first defines two functions  prefixSum(i)  and  suffixSum(i)  for the array as follows. The function  prefixSum(i)  denotes the sum of first  i  numbers of the array. Similarly, he defines  suffixSum(i)  as the sum of last  N - i + 1  numbers of the array. Little Chef is interested in finding the minimum index  i  for which the value  prefixSum(i) + suffixSum(i)  is the minimum. In other words, first you should minimize the value of  prefixSum(i) + suffixSum(i) , and then find the least index  i  for which this value is attained. Since, he is very busy preparing the dishes for the guests, can you help him solve this problem? The first line of the input contains an integer  T  denoting the number of test cases. \n The first line of each test case contains a single integer  N  denoting the number of integers in the array  A . The second line contains  N  space-separated integers  A 1 ,  A 2 , ...,  A N  denoting the array  A . For each test case, output a single line containing the answer. Example case 1.  Let's calculate prefixSum(i) + suffixSum(i) for all indexes  i  in the sample case.\n \nprefixSum(1) + suffixSum(1) = 1 + 6 = 7\nprefixSum(2) + suffixSum(2) = 3 + 5 = 8\nprefixSum(3) + suffixSum(3) = 6 + 3 = 9\n \n The minimum value of the function is 7, which is attained at index 1, so the answer would be 1. Example case 2.  Let's calculate prefixSum(i) + suffixSum(i) for all indexes  i  in the sample case.\n \nprefixSum(1) + suffixSum(1) = 2 + 7 = 9\nprefixSum(2) + suffixSum(2) = 3 + 5 = 8\nprefixSum(3) + suffixSum(3) = 6 + 4 = 10\nprefixSum(4) + suffixSum(4) = 7 + 1 = 8\n \n The minimum value of the function is 8, which is achieved for indices 2 and 4. The minimum of these two indices 2, 4 is index 2. Hence, the answer will be 2.     Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}