{"title": "Task for Alexey | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  ALEXTASK ", "Input": " \n3", "Output": " \n6", "Author": " \n 2", "Tester": " \n 6", "Date Added": " \n 11", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": " Alexey is trying to develop a program for a very simple microcontroller. It makes readings from various sensors over time, and these readings must happen at specific regular times. Unfortunately, if two of these readings occur at the same time, the microcontroller freezes and must be reset.  \nThere are  N  different sensors that read data on a regular basis. For each  i  from  1  to  N , the reading from sensor  i  will occur every  A i  milliseconds with the first reading occurring exactly  A i  milliseconds after the microcontroller is powered up. Each reading takes precisely one millisecond on Alexey's microcontroller.\n \nAlexey wants to know when the microcontroller will freeze after he turns it on.\n The first line of the input contains an integer  T  denoting the number of test cases. The description of  T  test cases follows. The first line contains single integer  N  denoting the number of sensors. \nThe second line contains  N  space-separated integers  A 1 , A 2 , ..., A N  denoting frequency of measurements. Namely, sensor  i  will be read every  A i  milliseconds with the first reading occurring  A i  milliseconds after the microcontroller is first turned on.\n   For each test case, output a single line containing the number of milliseconds until the microcontroller freezes.         Case 1: in 6 milliseconds, the third reading will be attempted from the 1st sensor and the second reading will be attempted from the 2nd sensor . Case 2: in 7 milliseconds the seventh reading will be attempted from the 1st sensor and the first reading will be attempted from the 3rd sensor . Case 3: in 4 milliseconds, the first readings from the first two sensors will be attempted .    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}