{"title": "Minimax | CodeChef", "time-limit": 2000, "memory-limit": -1, "props": {"Problem code": "  MINIMAX ", "holds true": " \n max", "nice grid": " \n 10 ", "Author": " \n 5", "Date Added": " \n 19", "Time Limit": " \n 2 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Let's consider a square grid with  N  rows and  N  columns, both numbered 1 through  N . Each cell contains one integer. Let r i  denote the minimum value in the i-th row, and let C i  denote the maximum value in the i-th column. A grid is called  nice  if and only if the following condition holds true: max(r 1 , r 2 , ..., r N ) = min(C 1 , C 2 , ..., C N ) Chef has a square grid and can change some of its elements (numbers in the cells).\nFind the minimum possible number of elements Chef should change, so that the new grid is nice. An element can be changed to any integer. The first line of the input contains an integer  N , denoting the size of the grid. The following  N  lines describe the grid.\nThe i-th of those lines contains  N  integers, denoting the numbers in the i-th row. Print one integer, denoting the minimum number of changes required to make the grid nice. Example #1.  In the first example, initially we have r 1  = 10, r 2  = 10 and r 3  = 5. For columns, we have C 1  = 20, C 2  = 20 and C 3  = 35. max(r 1 , r 2 , r 3 ) = 10 and min(C 1 , C 2 , C 3 ) = 20, and so the given grid isn't nice.\nChef can change the second number in the first row from 20 to 10, to get the following nice grid: The answer is 1 because we must change at least 1 number. Example #2.  The provided grid is already nice, so the answer is 0.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}