{"title": "Brackets | CodeChef", "time-limit": 500, "memory-limit": -1, "props": {"Problem code": "  BRACKETS ", "following constraint": "\n \n \n You can ", "Input": " \n1", "Author": " \n 6", "Date Added": " \n 25", "Time Limit": " \n 0.5 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "\n\tA valid parentheses sequence is a non-empty string where each character is either ' ( ' or ' ) ', which satisfies the following constraint:\n \n You can find a way to repeat erasing adjacent pairs of parentheses  ' () '  until it becomes empty. \n \n\tFor example, ' (()) ' and ' ()((()())) ' are valid parentheses sequences, but ' )()( ' and ' (() ' are not.\n \n\tMike has a valid parentheses sequence. He really likes everything about his sequence, except the fact that it is quite long. So Mike has recently decided that he will replace his parentheses sequence with a new one in the near future. But not every valid parentheses sequence will satisfy him. To help you understand his requirements we'll introduce the pseudocode of function  F(S) :\n \n\tIn other words,  F(S)  is equal to the maximal balance over all prefixes of  S .\n \n\tLet's denote  A  as Mike's current parentheses sequence, and  B  as a candidate for a new one. Mike is willing to replace  A  with  B  if  F(A)  is equal to  F(B) . He would also like to choose  B  with the minimal possible length amongst ones satisfying the previous condition. If there are several such strings with the minimal possible length, then Mike will choose the least one lexicographically, considering ' ( ' to be less than ' ) '.\n \n\tHelp Mike!\n \n\tThe first line of the input contains one integer  T  denoting the number of testcases to process.\n \n\tThe only line of each testcase contains one string  A  denoting Mike's parentheses sequence. It is guaranteed that  A  only consists of the characters  '('  and  ')' . It is also guaranteed that  A  is a valid parentheses sequence.\n \n\tThe output should contain exactly  T  lines, one line per each testcase in the order of their appearance. The only line of each testcase should contain one string  B  denoting the valid parentheses sequence that should be chosen by Mike to replace  A .\n 1 ≤  T  ≤ 5; 1 ≤  |A|  ≤ 100000(10 5 ).    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}