{"title": "Chef and collection of stamps | CodeChef", "time-limit": 2000, "memory-limit": -1, "props": {"Problem code": "  CHSTAMP ", "one day": " Chef can", "Input": " \n\n1", "Output": " \n\n16", "Author": " \n 5", "Tester": " \n 6", "Date Added": " \n 28", "Time Limit": " \n 2 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Chef has a collection of  N  postage stamps. Each stamp belongs to some type, which are enumerated as positive integers. More valuable stamps have a higher enumerated type. So, type  1  is the least valuable type of stamps, type  2  is a bit more valuable, and so on. Chef often communicates with other philatelists via a stamp exchange website called P-bay. On any particular day, P-bay lists several offers, each of which is represented as an unordered pair { A ,  B }, allowing its users to exchange stamps of type  A  with an equal number of stamps of type  B . Chef can use such an offer to put up any number of stamps of enumerated type  A  on the website and get the same number of stamps of type  B  in return, or vice-versa (of course, he must have enough stamps of the corresponding type). Assume that any number of stamps Chef wants are always available on the site's exchange market. Each offer is open during only one day: Chef can't use it after this day, but he can use it several times during this day. If there are some offers which are active during a given day, Chef can use them in any order. Chef is interested in making his collection as valuable as possible. Help him to find maximum possible value of his collection after going through (accepting or declining) all the offers. Value of Chef's collection is equal to the sum of type enumerations of all stamps in the collection. The first line of the input contains an integer  T  denoting the number of test cases. The  description of  T  test cases follows. The first line of each test case contains two integers  N  and  M  denoting number of stamps in Chef's collection and number of offers, respectively. Next line contains  N  integers denoting the enumerated types of stamps in Chef's collection. The  i th  of the following  M  lines contains three integers —  T i ,  A i  and  B i  — denoting that on day  T i , there is an offer about exchanging stamps of types  A i  and  B i . For each test case, output a single line containing maximum possible value of Chef's collection after all offers. Subtask 1: (33 points) Subtask 2: (67 points) Example case 1.  Chef can use  2 nd  offer to exchange the stamp of type  1  with an stamp of type  3 . After that he can use  1 st  offer to exchange his 2 stamps of type  3  with 2 stamps of type  4 . Finally, on  3 rd  day Chef uses the offer to exchange the stamp of type  5  with an stamp of type  8 . After this transaction, value of his collection becomes  4 + 4 + 8 = 16 .    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}