{"title": "Bear and Milky Cookies | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  COOMILK ", "Input": " \n4", "Output": " \nYES", "Author": " \n 5", "Tester": " \n 5", "Date Added": " \n 22", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Limak is a little polar bear, who loves eating cookies and drinking milk.\nFor this reason he often visits Chef's kitchen. Limak is going to spend  N  minutes in the kitchen.\nEach minute he either eats a cookie or drinks milk.\nCookies are very sweet and thus Limak's parents have instructed him, that after eating a cookie, he has to drink milk in the next minute. You are given whether he ate a cookie or drank milk in each of the  N  minutes. Your task is to check if Limak followed his parents' instructions. That is, you need to verify whether after each eaten cookie he drinks milk in the next minute.\nPrint \"YES\" or \"NO\" for each test case accordingly. The first line of the input contains an integer  T  denoting the number of test cases. The description of  T  test cases follows. The first line of each test case contains an integer  N  denoting the number of minutes. The second line of a test case contains  N  space-separated strings  S 1 ,  S 2 , ...,  S N .\nThe string  S i  is either \"cookie\" (if Limak eats a cookie in the i-th minute) or \"milk\" (otherwise). For each test case, output a single line containing the answer — \"YES\" if Limak followed his parents' instructions, and \"NO\" otherwise, both without the quotes. Test case 1.  Limak is in the kitchen for 7 minutes.\nHe eats three cookies and after each of them he indeed drinks milk in the next minute.\nThe answer is \"YES\". Test case 2.  Limak is in the kitchen for 5 minutes.\nIn the first minute he eats a cookie and in the second minute he eats a cookie again, instead of drinking milk.\nThe answer is \"NO\". Test case 3.  Here Limak doesn't eat any cookies.\nThe answer is \"YES\" because the condition is satisfied (there is no situation when Limak eats a cookie but doesn't drink milk in the next minute). Test case 4.  Limak eats a cookie and doesn't drink milk in the next minute so the answer is \"NO\".    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}