{"title": "Chang and Perfect Quadruples | CodeChef", "time-limit": 3000, "memory-limit": -1, "props": {"Problem code": "  CHNGSUM ", "such that": "\n \n i", "Input": " \n3", "Output": " \n19", "Author": " \n 5", "Date Added": " \n 25", "Time Limit": " \n 3 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "\nChang was not able to sleep well last night as he was thinking about a problem which still remains unsolved. Since he has only a day left to solve this problem and hand it to the interviewer, you being his friend decide to help him solve this so that he can clear this round and get a much-needed job. The problem is as follows. \nGiven a list  L  of  N  integers, Chang defines a perfect quadruple  (i, j, k, l)  such that:\n \n i, j, k, l  are the indices of the list \n i ≤ j < k ≤ l \n \n \nYou need to find the summation of  F(i, j, k, l)  over all perfect quadruples  (i, j, k, l) .\n F(i, j, k, l)  is calculated as the product of maximum element in range  [i, j]  and the minimum element in range  [k, l] . Since, the answer can be large, print it modulo  10^9 + 7 . \n The first line of the input contains a single integer  N  denoting the number of elements in the list. The second line contains  N  space-separated integers  L 1 ,  L 2 , ...,  L N  denoting the elements of the list. Ouput an integer corresponding to the answer to the only test case in a line. \nThe perfect Quadruples and their individual contribution is calculated as. \n F(1, 1, 2, 2) = 2*1 = 2 \n F(1, 1, 2, 3) = 2*1 = 2 \n F(1, 1, 3, 3) = 2*3 = 6 \n F(1, 2, 3, 3) = 2*3 = 6 \n F(2, 2, 3, 3) = 1*3 = 3 \n \n \nAll these values sum up to  19 .\n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}