{"title": "Sereja and Two Strings 2 | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  SEATSTR2 ", "lines": "\n \n Each line ", "Input": " \n2", "Output": " \n0", "Author": " \n 6", "Tester": " \n 4", "Date Added": " \n 11", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "\nSereja has a string  A  consisting of  n  lower case English letters.\n \nSereja calls two strings  X  and  Y  each of length  n   similar  if they can be made equal by applying the following operation at most once in  each  of them. \nFor example strings  \"abcd\"  and  \"acbd\"  are similar, strings  \"ab\"  and  \"ab\"  are similar, but strings  \"abcde\"  and  \"bcdea\"  are not similar. Note that strings   \"abc\"  and  \"cab\"  are also similar, as you can swap 'a' and 'c' in the first string to get  \"cba\"  and 'a' and 'b' in the second string to get  \"cba\" .\n \nNow Sereja is interested in finding number of  ordered  pairs of non  similar  strings  X  and  Y  such that they can be constructed from a given string  A  by permutation of its characters. As answer could be large, please output your answer modulo  (10 9  + 7).\n \n Note   \nA string  s  (of size  n ) is said to be constructed from string  t  (also of size  n ) by permutation of its characters if there exists a permutation  P  (of length  n ), such that  s[i] = t[P[i]]  for each  i  from 1 to  n .\n For each test case, output answer modulo 1000000007 (10 9  + 7) in separate line.     Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}