{"title": "Devu and an Array | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  DEVARRAY ", "Output": " \nYes", "Author": " \n admin2 ", "Tester": " \n 6", "Date Added": " \n 17", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Devu has an array  A  consisting of  N  positive integers. He would like to perform following operation on array.\n \n Pick some two elements  a, b  in the array ( a  could be same as  b , but their corresponding indices in the array should not be same).\nRemove both the elements  a  and  b  and instead add a number  x  such that  x  lies between  min(a, b)  and  max(a, b) , both inclusive, (i.e.  min(a, b) ≤ x ≤ max(a, b)) .\n \n \nNow, as you know after applying the above operation  N - 1  times, Devu will end up with a single number in the array. He is wondering whether it is possible to do the operations in such a way that he ends up a number  t . \n \nHe asks your help in answering  Q  such queries, each of them will contain an integer  t  and you have to tell whether it is possible to end up  t . \n There is only one test case per test file. First line of the input contains two space separated integers  N, Q  denoting number of elements in  A  and number of queries for which Devu asks your help, respectively Second line contains  N  space separated integers denoting the content of array  A .\n Each of the next  Q  lines, will contain a single integer  t  corresponding to the query. Output  Q  lines, each containing \"Yes\" or \"No\" (both without quotes) corresponding to the answer of corresponding query. \n Subtask #1 : 30 points \n \n 1 ≤  A i  ≤  2 \n \n \n Subtask #2 : 70 points \n \n 1 ≤  A i  ≤  10 9 \n \n In the first example , Devu can't apply any operation. So the final element in the array will be 1 itself. \n In the second example ,\nDevu can replace 1 and 3 with any of the numbers among 1, 2, 3. Hence final element of the array could be 1, 2 or 3. \n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}