{"title": "Easy Numbers | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  EZNO ", "interesting property": " Let the ", "Input": " \n2", "Output": " \n1", "Author": " \n 5", "Tester": " \n 7", "Date Added": " \n 14", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "While studying representation of numbers in various bases, Chef discovered an interesting properties of some  positive  numbers, which Chef believed are somewhat easy to memorize. Chef called such  positive  numbers  easy  numbers. These numbers had an interesting property: Let the base Chef is currently studying be  b . Represent the number in base  b  (without leading zeros). For each prefix of length  k  (from 1 to number of digits in number in the base), the number formed by considering the digits of the prefix in base  b  is divisible by  k . \nFor example, let base Chef is studying be  2 . \n \n 1 is an  easy  number as its prefix of length 1 (i.e. 1) is divisible by 1. \n 2 is also an  easy  number, as its prefix of length 1 (i.e. 1) is divisible by 1 and the prefix of length 2 (i.e. 2, represented as 10 in base 2) is also divisible by 2. \n 3 is not an  easy  number, as its prefix of length 2 (i.e. 3, represented as 11 in base 2) is not divisible by 2. \n \n \nNow Chef finds these numbers easy and thinks that following question related to  easy  numbers will be easy for you too. He asks you to find the number of  easy  numbers represented in base  b  and consisting of exactly  d  digits. As the answer could be quite large, output it modulo  10 9  + 7 .\n First line of the input contains a single integer  T  denoting the number of test cases. For each test case, there will be a single line containing two space separated integers  b, d , denoting the base and number of digits respectively. Example case 1.  There are 2 numbers in base 2 consisting of 2 digits. Those are 2 (represented as 10 in base 2) and 3 (represented as 11 in base 2). 2 is an easy number, whereas 3 is not (see the explanation about it in the problem statement). Hence the number of easy numbers consisting of 2 digits in base 2 are 1.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}