{"title": "Samosa Bhai and his Courier Company | CodeChef", "time-limit": 1500, "memory-limit": -1, "props": {"Problem code": "  KOL1506 ", "Input": " \n5", "Output": " \n50", "Author": " \n 6", "Date Added": " \n 9", "Time Limit": " \n 1.5 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n C", "now is": "  \n Your IP"}, "statement": "\nSamosa Bhai got tired of the difficult tasks given by CodeChef along with meagre salary being paid to him. So he moves to Aloo uncle's village and opens a courier company there. In the village, everyone knows Aloo uncle and Kachori Aunty, so everyone sends their gifts using Samosa Bhai's courier company only. \nThere are  N  houses in a row in the village. On New Year's Eve, each house sends a gift to all the other houses. \nThe distance between two houses situated at positions  x  and  y  in the row is  |x - y| . Samosa Bhai's courier company charges  d k  rupees for each delivery, where  d  is the distance between the 2 houses.  \nEveryone chose Samosa Bhai's company because of Aloo uncle and Kachori aunty. So he decides to give them the amount of money earned by him modulo  1000000007 (10 9  + 7) . You need to compute this amount.\n Example case 1.  House 1 sends a gift to House 2 with cost (|2 - 7|) 2  and house 2 sends a gift to house 1 with cost (|7-2|) 2 , for a total cost of 50 Example case 3.  The cost for gift from house with index 1 to house with index 2 is 2 2  = 4, from houses 1 to 3 is 1, from houses 2 to 3 is 1. Taking into account the gifts sent the other way (from 2 to 1, 3 to 1 and 3 to 2), the total cost is 4 + 1 + 1 + 4 + 1 + 1 = 12    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}