{"title": "Cutting Recipes | CodeChef", "time-limit": 278, "memory-limit": -1, "props": {"Problem code": "  RECIPE ", "Author": " \n 6", "Tester": " \n friggstad ", "Date Added": " \n 12", "Time Limit": " \n 0.278837 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "The chef has a recipe he wishes to use for his guests, \nbut the recipe will make far more food than he can serve to the guests. \nThe chef therefore would like to make a reduced version of the recipe which has the same ratios of ingredients, but makes less food. \nThe chef, however, does not like fractions. \nThe original recipe contains only whole numbers of ingredients, \nand the chef wants the reduced recipe to only contain whole numbers of ingredients as well. \nHelp the chef determine how much of each ingredient to use in order to make as little food as possible. Input will begin with an integer T, the number of test cases. \nEach test case consists of a single line. \nThe line begins with a positive integer N, the number of ingredients. \nN integers follow, each indicating the quantity of a particular ingredient that is used. For each test case, output exactly N space-separated integers on a line, \ngiving the quantity of each ingredient that the chef should use in order to make as little food as possible. T≤100 \n2≤N≤50 \nAll ingredient quantities are between 1 and 1000, inclusive.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}