{"title": "Xenny and Alternating Tasks | CodeChef", "time-limit": 6000, "memory-limit": -1, "props": {"Problem code": "  XENTASK ", "Input": " \n1", "Output": " \n5", "would be": " 2 ", "Author": " \n 3", "Tester": " \n 6", "Date Added": " \n 15", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Xenny and Yana were very keen to celebrate Valentine's Day at their home.\nTo make preparations for the celebration, they listed down  N  tasks that they had to complete.\n \nTo complete the  i th  task, Xenny takes  X i  seconds and Yana takes  Y i  seconds.\nIn order to minimize the disparity in tasks performed, they decide to do the tasks  alternatingly . If Xenny did the  1 st  task,\nthen Yana would just wait and watch him until he completes the task. After that, Yana would start the  2 nd  task, and while\nshe does her task, Xenny would just watch her. He would start the  3 rd  task only after her completion, and they would keep\ndoing tasks alternatingly uptil the  N th  task. They could also do tasks in the other order - that is, Yana could do the  1 st  task,\nafter that Xenny could do the  2 nd  task, and so on.\nTheir eventual goal was to minimize the total time taken by them to complete all  N  tasks.\n \nPlease help them find the minimum total time they would take to complete all  N  tasks.\n The first line of the input contains an integer  T  denoting the number of test cases. The description of  T  test cases follows. The first line of each testcase contains a positive integer  N  - the number of tasks to be completed. The second line contains  N  space-separated positive integers representing the time taken in seconds by Xenny to complete the  i th  task. The third line contains  N  space-separated positive integers representing the time taken in seconds by Yana to complete the  i th  task. For each testcase, print a single line containing the minimum total time in seconds Xenny and Yana would take to complete the tasks. Subtask 1: 40 points Subtask 2: 60 points \nLet's say Xenny does the 1 st  task. Then Yana would do the 2 nd  task and\nXenny would do the 3 rd  task.\nHence, the total time taken would be: 2 + 2 + 2 = 6 seconds.\n \nAnother possibility is that Yana does the 1 st  task, Xenny does the 2 nd  task and then\nYana does the 3 rd  task. The total time taken in this case would be 5 seconds.\n \nHence, the  minimum  total time taken would be  5 seconds .\n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}