{"title": "Chef Shifu and Celebration | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  CHSHIFU ", "each testcase": " \nThe first ", "Author": " \n 3", "Date Added": " \n 22", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Chef Shifu wanted to celebrate the success of his new restaurant with all his employees. He was willing to host a party and he had decided the location of the party as well. However, Chef Shifu was a shy person and wanted to communicate with the least possible employees to inform them about the party, and that these employees could inform their friends. \nNote that an employee could only inform his/her immediate friends about the party, not his/her friends’ friends. \nChef Shifu has a list of all the friendships among his employees. Help him find the minimum number of employees he should inform, so that every employee knows about the celebration party. First line contains a single integer  T  - the total number of testcases. \n T  testcases follow. For each testcase: \nThe first line contains 2 space-separated integers  N  and  M  - the total number of employees working under Chef Shifu and the number of friendship relations. \n M  lines follow - each line contains 2 space-separated integers  u  and  v , indicating that employee  u  is a friend of employee  v  and vice-versa. \nThe employees are numbered from 1 to N, and each employee is assigned a distinct integer. For each testcase, print the  minimum  number of employees to be informed on a new line. Subtask 1: 5 points \n1 ≤  T  ≤ 5 \n1 ≤  N  ≤ 4 \n0 ≤  M  ≤ N*(N-1)/2 Subtask 2: 35 points \n1 ≤  T  ≤ 5 \n1 ≤  N  ≤ 15 \n0 ≤  M  ≤ N*(N-1)/2 Subtask 3: 60 points \n1 ≤  T  ≤ 5 \n1 ≤  N  ≤ 20 \n0 ≤  M  ≤ N*(N-1)/2 Input Output Explanation \nIn testcase 1, since every employee is a friend of every other employee, we just need to select 1 employee. In testcase 2, selecting employees 2 and 4 would ensure that all 4 employees are represented. \nSimilarly, selecting employees 1 and 3 would also ensure that all 4 employees are selected. \nIn both cases, we must select 2 employees in the best case.\n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}