{"title": "Chef and Circle Run | CodeChef", "time-limit": 2000, "memory-limit": -1, "props": {"Problem code": "  CHEFCRUN ", "Input": " \n2", "Output": " \n2", "Author": " \n berezin ", "Tester": " \n 6", "Date Added": " \n 13", "Time Limit": " \n 2 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Chef likes to play with graphs a lot. Today he created a graph in the following way. He first lays down  N  nodes in a circle. The nodes nodes are numbered from  1  to  N , in the clockwise order, i.e. the node  2  is followed by  1 ,  3  is followed by  2 , and  1  is followed by  N . Two vertices are said to be adjacent if they don't have an intermediate vertex placed between them. There is an edge between each adjacent pair of vertices, so there are total  N  such edges. Each edge has an integer associated with it (may be negative). \n Chef wants to find a  walk  from node  start  to node  end  using the above described edges. Chef has to pay cost for each edge in the walk equal to the integer associated with the edge. He wants to minimize the total cost he will incur. Also, Chef does not like to move through an edge more than twice. Find out minimum cost that Chef has to pay. Note that a walk from a node  u  to  v  can contain repeated vertices in it. Please refer to   link  for a formal definition. The first line of the input contains an integer  T  denoting the number of test cases. The description of  T  test cases follows. The first line of each test case contains a single integer  N  denoting the number of nodes.  The second line contains  N  space-separated integers  R 1 ,  R 2 , ...,  R N  denoting the integer of the rib from node  i  to node  (i % N) + 1 . Note that  R N  is an integer on a rib from node  N  to node  1 .  The third line contains two integers  start  and  end  denoting the first and the last node of the walk.  For each test case, output a single line containing the minimal possible cost Chef need to pay. \n -10 6  ≤  R i  ≤  10 6 \n 1  ≤  start  <  end  ≤  N \n \n Subtask #1 (20 points):   1  ≤ sum of  N  ≤  20 ;  1  ≤  N  ≤  8 \n Subtask #2 (30 points):   1  ≤ sum of all  N  ≤  10 3 ;  1  ≤  N  ≤  200 \n Subtask #3 (50 points):   1  ≤ sum of all  N  ≤  10 6 ;  1  ≤  N  ≤  2 × 10 5   \n Example case 1.  Chef's walk starts with node 1. He goes to node  4  by incurring a cost of 1. Then from node 4, he goes to node 3 by incurring a cost of 1 more. Total cost incurred is 2. Example case 2.  Chef goes from  1  to  2  by incurring a cost of  -5 . Then from  2  to  1  using the edge  second time  and incurring cost of  -5  again. Now, he can not use the edge between 1 and 2 again, as he has traversed the edge already twice. Now he will go from node 1 to node 4 by paying a cost of 2. Total sum of costs incurred is -5 + -5 + 2 = -8. This is the minimum possible cost that Chef can have.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}