{"title": "Save The Trees | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  KOL1509 ", "Input": " \n2", "Output": " \n6", "Author": " \n 4", "Date Added": " \n 18", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n C", "now is": "  \n Your IP"}, "statement": "\nCodeChef has been very busy with his christmas preparations and he doesn't have time to look after Samosa Bhai and Jalebi Bai. To keep them busy, CodeChef has given them an array  A  of size  N . He has asked them to plant trees at the points with Cartesian coordinates ( A[ i ] ,  A[ j ] ), such that  i  <  j . \n \nThere are a lot of giraffes nearby. To save the trees from the giraffes, they decide to build a fence around the trees. Moreover, they want to use the minimum length of fencing for this task. Find the value equal to  twice the area  covered by the fence using the minimum length of fencing.\n The first line contains  T , the number of test cases to follow. The first line of each test case contains an integer  N , the size of the array. The second line of the test case contains  N  space-separated integers. For each test case, output the value equal to  two times the area , rounded to the nearest integer, surrounded by the fence when using the minimum length of net to surround all the trees. Example case 1. Covered portion is a right angled triangle with vertices (2,4), (2,1) and (4,1). Area = (1/2)*2*3 = 3. Example case 2. \n \nA, B, C, D, E, and F denote the trees. \nThe above image denotes the situation. \nArea of the figure = 6.5 \n2*(Area of Triangle ABC + Area of Triangle BFE + Area of Square EFCD) is the answer. \nArea of Triangle ABC = 1.5 \nArea of Triangle BFE = 1 \nArea of Square EFCD = 2*2 = 4 \n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}