{"title": "Chef And Coloring | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  COLOR ", "Explanation": " \n \n Test 1", "Author": " \n 4", "Tester": " \n 6", "Date Added": " \n 11", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "After a long time, Chef has finally decided to renovate his house. Chef's house has  N  rooms in it numbered from 1 to  N . Each room is currently painted in one of the red, blue or green colors. Your are given configuration of colors of his house by a string  S  consisting of  N  characters. In this string, color red will be denoted by 'R', green by 'G' and blue by 'B'.\n \nChef does not like current painting configuration that much and would like to repaint the house such that each room has same color.  For painting, Chef has all the 3 color paints available and mixing any 2 color paints will result into 3rd color paint i.e\n \n R + B = G \n B + G = R \n G + R = B \n \n   For example, painting a room having red color before with green color paint will make the color of room blue.\n \nAlso, Chef has many buckets of paint of each color. Simply put, you can assume that he will not run out of paint.\n Being extraordinary lazy, our little chef does not want to work much and therefore, he has asked you to find the minimum number of rooms he has to repaint  (possibly zero)  in order to have all the rooms with same color. Can you please help him? First line of input contains a single integer  T  denoting the number of test cases. First line of each test case contains an integer  N  denoting the number of rooms in the chef's house. Next line of each test case contains a string  S  denoting the current color configuration of rooms. For each test case, Print the minimum number of rooms need to be painted in order to have all the rooms painted with same color i.e either red, blue or green.    Input \n Output    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}