{"title": "Subsequence Equality | CodeChef", "time-limit": 500, "memory-limit": -1, "props": {"Problem code": "  LIKECS01 ", "such that": "\n\n \n 1", "Author": " \n 6", "Tester": " \n 6", "Date Added": " \n 8", "Time Limit": " \n 0.5 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Chef Tobby is playing a rapid fire with Bhuvan. He gives Bhuvan a string  S  and each time, Bhuvan has to guess whether there exists  2  equal  subsequences  in the string or not. Bhuvan got a perfect score in the game with Chef Tobby. However, Chef Tobby has now asked Bhuvan to write a program that will do this automatically given a string  S . Bhuvan is an intelligent man but he does not know how to write a code. Can you help him? Find two different subsequences such that they are equal in their value, more formally, find two sequences of indices (a 1 , a 2 , ..., a k-1 , a k ) and (b 1 , b 2 , ..., b k-1 , b k ) such that:\n\n \n 1≤ a i , b i  ≤ |S| \n a i  < a i+1  for all valid i \n b i  < b i+1  for all valid i \n S a i  = S b i  for all valid i \n there exist at least one i such that a i  is not equal to b i \n \n Input section \n The first line contains  T , the number of test cases. Each of the next  T  lines contain one string  S  each. Input will only consist of lowercase english characters \n Output section \n For each test case, output  \"yes\"  or  \"no\"  (without quotes) as the solution to the problem. In test case  2 , one of the possible equal subsequence is  \"vi\"  and  \"vi\" . (one at position  {0, 3}  and other at  {4, 7} , assuming 0-based indexing). In test case  4 , one of the possible equal subsequence is  \"ce\"  and  \"ce\" . (one at position  {0, 3}  and other at  {4, 6} , assuming 0-based indexing).    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}