{"title": "Nothing in Common | CodeChef", "time-limit": 2000, "memory-limit": -1, "props": {"Problem code": "  NOTINCOM ", "Input": " \n2", "Output": " \n1", "Author": " \n 6", "Tester": " \n 5", "Date Added": " \n 11", "Time Limit": " \n 2 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Alice has quarreled with Berta recently. Now she doesn't want to have anything in common with her! Recently, they've received two collections of positive integers. The Alice's integers were  A 1 ,  A 2 , ...,  A N , while Berta's were  B 1 ,  B 2 , ...,  B M . Now Alice wants to throw away the minimal amount of number from her collection so that their collections would have no common numbers, i.e. there won't be any number which is present in both collections. Please help Alice to find the minimal amount of numbers she would need to throw away. The first line of the input contains an integer  T  denoting the number of test cases. The description of  T  test cases follows. The first line of each test case contains two space-separated integer numbers  N  and  M  denoting the amount of numbers in Alice's and Berta's collections respectively. The second line contains  N  space-separated integers  A 1 ,  A 2 , ...,  A N  denoting the numbers of Alice.  The third line contains  M  space-separated integers  B 1 ,  B 2 , ...,  B M  denoting the numbers of Berta.  For each test case, output a single line containing the minimal amount of numbers Alice needs to throw away from her collection so that she wouldn't have any numbers in common with Berta. Example case 1.  If Alice throws away the number  3  from her collection, she would obtain  {1, 2}  which is disjoint with  {3, 4, 5, 6} . Example case 2.  Girls don't have any number in common initially. So there is no need to throw away any number.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}