{"title": "Animesh practices some programming contests | CodeChef", "time-limit": 3000, "memory-limit": -1, "props": {"Problem code": "  CHN03 ", "test case ": "  \n \n The first ", "Input": " \n2", "Output": " \n6", "Author": " \n admin2 ", "Date Added": " \n 15", "Time Limit": " \n 3 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n C", "now is": "  \n Your IP"}, "statement": "\nAs you know, Malvika has created some  n  programming contests. Each of the contests has three problems, categorized as easy, medium and hard on difficulty level. For the  i th  contest, easy problem takes  TE[i]  hours and gives you  PE[i]  pleasure. Similarly, medium problem takes  TM[i]  hours, gives  PM[i]  pleasure, and a hard one has the values  TH[i] ,  PH[i] .\n \nToday, Animesh wanted to practice some of them. Animesh has a really bad habit of trying problems for only a few minutes and saying to Malvika \"I am a noob, you are a pro. It's some weird shit I don't know. Please, tell me the solution, bro!\" Having been irritated by this behaviour numerous times in the past, she granted him  K  special powers he can use before starting the practice session. By using a single power, Animesh can pick any two problems irrespective of their difficulty from two different contests and swap them. \n \nAnimesh has at max  time  hours before he gets frustrated by his noobness and ends the practice session. He wants to make the maximum use of it by getting as much pleasure out of this activity as possible. Animesh also gets bored with the contest themes fairly quickly, so he does not want to solve more than one problem from any contest. Can you help Animesh in estimating the maximum amount of pleasure he can achieve out of this activity?\n In the first example , \nMalvika has prepared only one programming contest, its easy problem takes 1 hour and gives 5 units of pleasure. The medium one takes 2 hours and gives 3 units of pleasure whereas the same values for hard are 3 hours and 6 units of pleasure. Animesh has only 5 hours and can select at max one problems out of these to solve. The hard problem is the best candidate to choose for him, it will him give him 6 units of pleasure and take his 5 hours. So, the answer is 6.\n In the second example , \nMalvika has prepared two programming contests.\n \n First programming contest:\n\t\t \n  Easy problem — 1 hour and 5 units of pleasure. \n  Medium problem — 2 hours and 3 units of pleasure. \n  Hard problem — 1 hours and 3 units of pleasure. \n \n \n Second programming contest:\n\t\t \n  Easy problem — 2 hours and 4 units of pleasure. \n  Medium problem — 3 hours and 6 units of pleasure. \n  Hard problem — 3 hours and 5 units of pleasure. \n \n \n \n\nAnimesh has 6 hours and can use at max one swapping power. He can select the easy problem of the first programming contest and the medium problem of the second one. It will take him 4 hours and give him 11 units of pleasure.\n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}