{"title": "Devu and a light discussion | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  DEVLDISC ", "then": "\n Print a ", "Input": " \n2", "Author": " \n admin2 ", "Tester": " \n 6", "Date Added": " \n 3", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "\nOne day, Devu and Churu were involved in a light discussion about finding the diameter of an undirected unweighted connected graph. Diameter of a graph is the maximum value of pairwise shortest distances over all pairs of vertices of the graph. Churu proposed the following algorithm which takes a parameter  start_vertex .\n\n \nAlgorithm ( start_vertex ):\n\tfind out the set of vertices  S  having maximum value of \n\t\tshortest distance from  start_vertex .\n\tans = 0;\n\tfor each vertex v in  S \n\t\ttemp = 0;\n\t\tfor each vertex u in graph G:\n\t\t\ttemp = max(temp, shortest distance between u and v).\n\t\tans = max(ans, temp);\n\treturn ans;\n \n \nWhen Devu heard this algorithm, he exclaimed: \"What, this does not seem to be correct!\". Churu challenged him to give a counter example to disprove the algorithm. You have to help Devu come up with a graph as a counter example to the above algorithm, if one exists.\n \nFormally, You will be given an integer  n  denoting the number of nodes of the expected graph (counter example Devu is producing). The graph should be undirected, unweighted and connected. The actual diameter of the graph should not be equal to the one returned by the Churu's proposed algorithm. \n\nIf for the given  n , there does not exist any such graph which could act as counter example, print -1.\n Example case 1.  There can be only one connected graph of 2 nodes. (i.e. 1 is connected to 2). Diameter returned by algorithm for any start vertex will be 1 which is equal to the actual diameter. So answer is -1.\n Example case 2.  Please note that example given for  n = 10  is  not a correct counter example . It is only given so as to clarify the input output format. In the example, first line contains  9  denoting the number of edges in the graph. Then  9  edges of the graph are given. The graph is connected. Then the last line specifies the value of  start_vertex  passed (that is,  7 ) to Churu's algorithm.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}