{"title": "Movie Weekend | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  MOVIEWKN ", "of movies": " from drama ", "Input": " \n2", "Output": " \n1", "Author": " \n 6", "Tester": " \n 4", "Date Added": " \n 26", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Little Egor is a huge movie fan. He likes watching different kinds of movies: from drama movies to comedy movies, from teen movies to horror movies. He is planning to visit cinema this weekend, but he's not sure which movie he should watch. There are  n  movies to watch during this weekend. Each movie can be characterized by two integers  L i  and  R i , denoting the length and the rating of the corresponding movie. Egor wants to watch  exactly  one movie with the maximal value of  L i  × R i . If there are several such movies, he would pick a one with the maximal  R i  among them. If there is still a tie, he would pick the one with the minimal index among them. Your task is to help Egor to pick a movie to watch during this weekend. The first line of the input contains an integer  T  denoting the number of test cases. The first line of the test case description contains an integer  n . The second line of the test case description contains  n  integers  L 1 , L 2 , ...,L n . The following line contains  n  integers  R 1 , R 2 , ..., R n . For each test case, output a single integer  i  denoting the index of the movie that Egor should watch during this weekend. Note that we follow 1-based indexing. In the first example case, both films have the same value of  L × R , but the first film has a better rating. In the second example case, the second and the fourth movies are equally good, but the second movie has a smaller index.    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}