{"title": "Train Partner | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  ANKTRAIN ", "arranged as": "\n \n 1LB", "Partners ": " \n \n3UB ", "Input": " \n3", "Output": " \n4LB", "Author": " \n 5", "Tester": " \n 7", "Date Added": " \n 20", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Rahul and Rashi are off to the wedding of a close relative. This time they have to travel without their guardians. Rahul got very interested in the arrangement of seats inside the train coach. The entire coach could be viewed as an arrangement of consecutive blocks of size 8.  \n \nBerth Number   \tCompartment\n\n 1 -  8               1  \n 9 - 16               2  \n17 - 24               3  \n... and so on\n \n Each of these size-8 blocks are further arranged as:\n \n 1LB,  2MB,  3UB,  4LB,  5MB,  6UB,  7SL,  8SU  \n 9LB, 10MB, ...\n ...   \n ...\n \n\nHere  LB  denotes lower berth,  MB  middle berth and  UB  upper berth.\n The following berths are called  Train-Partners : and the pattern is repeated for every set of 8 berths. Rahul and Rashi are playing this game of finding the train partner of each berth. Can you write a program to do the same? The first line of input contains a single integer  T , denoting the number of test cases to follow. Each of the next  T  lines contain a single integer  N , the berth number whose neighbor is to be found out. The output should contain exactly  T  lines each containing the berth of the neighbor of the corresponding seat. \n Subtask #1 (50 points): \n \n 1  ≤  T  ≤  8 \n 1  ≤  N  ≤  8 \n \n \n Subtask #2 (50 points): \n \n 1  ≤  T  ≤  100 \n 1  ≤  N  ≤  500 \n \n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}