{"title": "Chef and Inflation | CodeChef", "time-limit": 2000, "memory-limit": -1, "props": {"Problem code": "  CHINFL ", "single number": " the maximum ", "Input": " \n3 3 ", "Output": " \n15.0000000000", "Author": " \n 4", "Tester": " \n 6", "Date Added": " \n 23", "Time Limit": " \n 2 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "\nA recent glut in Chefland's markets has caused the local currency  Peppercorn  to devaluate sharply. (Peppercorns are getting cheaper on an average, though there could be ups and downs).\n \nAnd Chef needs to rescue his wealth! Initially, he had  D  Peppercorns. There are  N  exchange kiosks in the city he lives in, where he can go and exchange his Peppercorns for a well-known stable currency, the Antarctican Dollar. For each kiosk, the exchange rate for the first  M  seconds of the day is known (both for buying and selling). All kiosks are arranged in a row, and to travel from the  i th  to the  j th  kiosk, you need to spend  |i-j|  seconds, and to exchange currency at any kiosk, you also need  1  second. So, starting at point of time  0  at any of the kiosks (he can get there before trading starts for the day), Chef runs from one kiosk to another to buy and sell currency. You need to find the maximum amount of Peppercorns Chef could have after the  M th  second.\n First line of input contains three numbers —  N ,  M  and  D .  N  lines follow.\n i th line ( i = 0 … N-1 ) contains  2*M  integers — currency rate for  i th  kiosk. Numbers  A i, 2j  and  A i, 2j+1  ( j = 0 … M-1 ) are the selling and buying rates, respectively, at the  j th  second for the  i th  kiosk.\n Output a single number: the maximum amount of money (in Peppercorns - in the end Chef ought to have all the money converted to local currency since it's the only valid currency in the country for financial operations) he could have after  M  seconds, with absolute or relative error not more than  1e-6 .  If the amount of money of any currency that Chef will own at any point of time exceeds  10 18 , output file should contain  only a single line  containing  the string  “Quintillionnaire”  (without quotes, followed by a newline character).    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}