{"title": "Chef and His Garden | CodeChef", "time-limit": 2000, "memory-limit": -1, "props": {"Problem code": "  CHAHG ", "Input": " \n3", "Output": " \n1", "Author": " \n 4", "Tester": " \n 6", "Date Added": " \n 23", "Time Limit": " \n 2 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Chef is an advocate for Go Green Initiative. Today he had  n  trees planted in a row outside his his restaurant. Today, the height of  i -th tree is  h i  feet. The trees grow at a rate of  m i  feet per day. Chef knows that trees will look beautiful if they form a  zig-zag  sequence. The trees will be said to be in  Zig-zag  sequence if the heights of tree first increases or decreases, then alternates between decreasing/increasing respectively. Formally, the trees will be said to in  Zig-zag  sequence if one of the following two conditions holds.\n\n \n h 1  < h 2  > h 3  < h 4  and so on.. \n h 1  >  h 2  < h 3  > h 4  and so on.. \n \n Chef wants to know intervals of time when the heights of the trees will form a  zig-zag  sequence. The first line of the input contains an integer  T  denoting the number of test cases. The description of  T  test cases follows. The first line of each test case contains a single integer  n , denoting the number of trees. The  i th  of following  N  lines contains two space separated integers  h i  and  m i , denoting the initial height and the growth speed for  i th  tree.\n  For each test case, output an integer  Q  - the amount of the periods of consecutive moments of time, when the trees for a zig-zag sequence. On the following  Q  lines, output the intervals of time when the trees' heights form a zig-zag sequence. For each intervals, output its' smallest and the largest instants of time. If the range is infinite, output Inf as the right bound. The test cases are designed in such a way that the total output won't exceed 2 MB. \n \n 1  ≤  T  ≤  10 5 \n 1  ≤  n  ≤  10 \n Subtask 1 (23 points):  0  ≤  h i ,  m i  ≤  10 \n Subtask 2 (77 points):  0  ≤  h i ,  m i  ≤  10 9 \n 1  ≤ sum of  n  over a test cases in a single test file ≤  5 × 10 5 \n \n Example case 1.  In the first case  0 2 0  is already a  zig-zag  sequence, but on the 2nd second it will become  2 6 6  and will never turn back into  zig-zag    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}