{"title": "The Lead Game | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  TLG ", "rounds": "\n \n \n    Round ", "given below": " \n \n    Round ", "Input": " \n \n5", "Output": " \n \n1 58", "Author": " \n admin ", "Date Added": " \n 28", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": " The game of billiards involves two players knocking 3 balls around \non a green baize table. Well, there is more to it, but for our \npurposes this is sufficient.  The game consists of several rounds and in each round both players \nobtain a score, based on how well they played. Once all the rounds \nhave been played, the total score of each player is determined by \nadding up the scores in all the rounds and the player with the higher \ntotal score is declared the winner.  The Siruseri Sports Club organises an annual billiards game where \nthe top two players of Siruseri play against each other. The Manager \nof Siruseri Sports Club decided to add his own twist to the game by \nchanging the rules for determining the winner. In his version, at the \nend of each round the leader and her current lead are calculated. Once \nall the rounds are over the player who had the maximum lead at the \nend of any round in the game is declared the winner.\n \nConsider the following score sheet for a game with 5 rounds:\n \nThe total scores of both players, the leader and the lead after \neach round for this game is given below:  The winner of this game is Player 1 as he had the maximum lead (58 \nat the end of round 1) during the game.  Your task is to help the Manager find the winner and the winning \nlead. You may assume that the scores will be such that there will \nalways be a single winner.  That is, there are no ties. Input  The first line of the input will contain a single integer N (N \n≤ 10000) indicating the number of rounds in the game.  Lines \n2,3,...,N+1 describe the scores of the two players in the N rounds. \nLine i+1 contains two integer Si and Ti, the scores of the Player 1 \nand 2 respectively, in round i.  You may assume that 1 ≤ Si ≤ \n1000 and 1 ≤ Ti ≤ 1000.   Output  Your output must consist of a single line containing two integers \nW and L, where W is 1 or 2 and indicates the winner and L is the \nmaximum lead attained by the winner. Example Input: Output:    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}