{"title": "Hull Sum | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  HULLSUM ", "programming contest": " \n You are ", "Note": " Remember that ", "Input": " \n5", "Author": " \n 5", "Date Added": " \n 20", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Chef prepares the following problem for a programming contest: You are given  N  points with integer coordinates (-1000 ≤ x i , y i  ≤ 1000).\nNo two points collide and no three points are collinear.\nFor each of the 2 N -1 non-empty subsets of points, find the size (the number of points) of its convex hull.\nPrint the sum of those sizes. Chef has already prepared some tests for his problem, including a test with the maximum possible answer.\nHe now needs a test with a quite small answer (but not necessarily the minimum possible one).\nFor given  N , your task is to find any valid set of  N  points for which the answer doesn't exceed 4 * 10 15  (4,000,000,000,000,000). The only line of the input contains a single integer  N , denoting the number of points. Print exactly  N  lines.\nThe i-th line should contain two integers x i  and y i , denoting coordinates of the i-th point. The printed set of points must satisfy all the given conditions. At least one such set exists for every  N  allowed by the constraints given below. Note: Remember that you don't print  N  in the first line. Let's analyze sizes of convex hulls for the provided output.\nThere are 2 5 -1 non-empty sets of points. The sum of sizes of convex hulls is (5 * 1) + (10 * 2) + (10 * 3) + 3 + 3 + (3 * 4) + 4 = 5 + 20 + 30 + 6 + 12 + 4 = 77, which obviously doesn't exceed 4 * 10 15 .    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}