{"title": "The making of a cake | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  KOL1504 ", "Input": " \n5", "Output": " \nYes", "swap order": "\n \n Swap Layer ", "Author": " \n 4", "Date Added": " \n 9", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n C", "now is": "  \n Your IP"}, "statement": "\nCodeChef has received an order from the President of Mithai country for his son's birthday cake. The president is a person of very high temper and CodeChef doesn't want to tick him him, so he had to prepare a cake exactly as described by the President's son. He asked for a cake with  N  layers and each layer has to be of a type specified by him. The type of layer is represented by a lowercase letter from the English alphabet.\n \nCodeChef asked his sous Chef, Jalebi Bai, to make this cake, who was very sleepy due to a very long and tiring journey to a planet far far away earlier.\nDue to tiredness, Jalebi Bai screwed up the the layers while baking the cake. Thankfully, it has the same number of layers as required, but any of the layers may or may not be the same as described in the order. CodeChef is really worried because of this, as making a new cake will cost him a huge amount of money.\n \nAt this point of time, Samosa Bhai comes to the rescue. He has a layer swapper (patent pending) which can swap the layers of a cake without ruining the cake. This swapper has a limitation that it can swap layers separated  exactly  by distance  D  only, meaning there should be  exactly   D-1  layers in between the two layers to be swapped.\n \nYou have to tell if the cake made by Jalebi Bai can be changed into the cake described by the President's son using Samosa Bhai's swapper.\n The first line contains  T , the number of test cases. The first line of each test case contains  N  and  D . The next line contains a lowercase string  A  representing the cake described by the President's son. The next line contains a lowercase string  B  representing the cake made by Jalebi Bai. For each test case, output \" Yes \" [without quotes] if it is possible to transform the cake  B  into cake  A  using the layer swapper. Otherwise, output \" No \" [without quotes]. Example case 1.  Swap layer 'y' with 'q'. Example case 2.  Follow the following swap order:\n \n Swap Layer 'f' with 'c', The cake will now be \"nbfc\" \n Swap Layer 'n' with 'b', The cake will now be \"bnfc\" \n Swap Layer 'n' with 'f', The cake will now be \"bfnc\" \n Swap Layer 'f' with 'b', The cake will now be \"fbnc\" \n Example case 4.  Follow the following swap order:\n \n Swap Layer 'b' with 'd', The cake will now be \"ebadc\" \n Swap Layer 'a' with 'e', The cake will now be \"abedc\" \n Swap Layer 'e' with 'c', The cake will now be \"abcde\" \n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}