{"title": "Mathison and the teleportation game | CodeChef", "time-limit": 2500, "memory-limit": -1, "props": {"Problem code": "  MATTEG ", "Note": " The time ", "Input": " \n3", "Output": " \n188", "Author": " \n 4", "Tester": " \n 6", "Date Added": " \n 23", "Time Limit": " \n 1 ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "\n  Mathison and Chef are playing a new teleportation game. This game is played on a  R × C  board where each cell contains some value. A cell at x-th row and y-th column is denoted by (x,y). The purpose of this game is to collect a number of values by\n teleporting from one cell to another. A teleportation can be performed using a tel-pair.\n \n  A player is  given  N  tel-pairs.  Each tel-pair can be used at most once and a player can use them in any order they like . Suppose a player is at cell  (a, b)  and the tel-pair is  (dx, dy) . Then, the player can reach in one teleportation\n  any cell  (c, d)  from   (a, b)   such that  |a − c| = dx  and  |b − d| = dy .\n \n  It is Mathison’s turn next in the game to make a sequence of moves.  \n  He would like to know what is the highest value of a path\n  of length   at most N+1  that starts in  (Sx, Sy)  and uses some (possibly all) of the tel-pairs given.\n \n  The first line contains a single integer,  T , the number of tests.\n \n  Each test starts with three integers,  R ,  C , and  N , representing the number of rows, columns, and tel-pairs.\n \n  The next line contains two integers,  Sx , and  Sy , representing the coordinates of the starting cell.\n \n  The next two lines will contain the description of the tel-pairs. The first one will contain  N  integers, the x-component of each tel-pair.\n  The second one will contain  N  integers, the y-component of each tel-pair.\n \n  Next, there will be  R  lines, each containing  C  integers, the description of the board.\n \n  The output file will contain  T  lines. Each line will contain the answer (i.e. the highest value of a path) to the corresponding test.\n Subtask #1  (15 points):\n \n T  ≤ 100 \n R, C  ≤ 10 \n N  ≤ 4 \n TL  = 1s \n \n Subtask #2  (25 points):\n \n T  ≤ 25 \n R, C  ≤ 100 \n N  ≤ 8 \n TL  = 1.5s \n \n Subtask #3  (30 points):\n \n T  ≤ 5 \n R, C  ≤ 1000 \n N  ≤ 8 \n TL  = 2s \n \n Subtask #4  (30 points):\n \n T  ≤ 5 \n R, C  ≤ 1000 \n N  ≤ 9 \n TL  = 2.5s \n \n    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}