{"title": "Cats and Dogs | CodeChef", "time-limit": 1000, "memory-limit": -1, "props": {"Problem code": "  CATSDOGS ", "Input": " \n3", "Output": " \nyes", "Author": " \n admin2 ", "Tester": " \n 6", "Date Added": " \n 11", "Time Limit": " \n 1 sec ", "Source Limit": " \n 50000 Bytes ", "Languages": " \n ADA", "now is": "  \n Your IP"}, "statement": "Chef is a farmer and a pet lover. He has a lot of his favorite pets cats and dogs in the barn. He does not know their exact count. But he knows that there are  C  cats and  D  dogs in the barn. Also, one day went to field and found that there were  L  legs of the animals touching the ground. Chef knows that cats love to ride on the dogs. So, they might ride on the dogs, and their legs won't touch the ground and Chef would miss counting their legs. Chef's dogs are strong enough to ride at max two cats on their back. It was a cold foggy morning, when Chef did this counting. So he is now wondering whether he counted the legs properly or not. Specifically, he is wondering is there a some possibility of his counting being correct. Please help Chef in finding it. First line of the input contains an integer  T  denoting number of test cases.  T  test cases follow. The only line of each test case contains three space separated integers  C, D, L  denoting number of the cats, number of the dogs and number of legs of animals counted by Chef, respectively. For each test case, output a single line containing a string \"yes\" or \"no\" (both without quotes) according to the situation. \n Subtask #1 (20 points) \n \n 1 ≤ T ≤ 10 4 \n 0 ≤ C, D ≤ 10 2 \n \n \n Subtask #2 (30 points) \n \n 1 ≤ T ≤ 10 5 \n 0 ≤ C, D ≤ 10 3 \n \n \n Subtask #3 (50 points) \n \n Original constraints \n \n Example 1.  There is one cat and one dog. The number of legs of these animals on the ground are 8, it can be possible when both cat and dog are standing on the ground. Example 2.  There is one cat and one dog. The number of legs of these animals on the ground are 4, it can be possible if the cat will ride on the dog, so its legs won't be counted by Chef, only the dog's legs will be counted. Example 3.  There is one cat and one dog. The number of legs of these animals are 2, it can not be true at all, Chef might have made some mistake. Hence answer is \"no\".    Fetching successful submissions Program should read from  standard input  and write to  standard output .  After you submit a solution you can see your results by clicking on the  [My Submissions]  tab on the problem page. Below are the possible results:   CodeChef was created as a platform to help programmers make it big in the world of algorithms,  computer programming  and  programming contests . At CodeChef we work hard to revive the geek in you by hosting a  programming contest  at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to  algorithms, binary search , technicalities like  array size  and the likes. Apart from providing a platform for  programming competitions , CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of  computer programming .  Try your hand at one of our many practice problems and submit your solution in a language of your choice. Our  programming contest  judge accepts solutions in over 35+ programming languages. Preparing for coding contests were never this much fun! Receive points, and move up through the CodeChef ranks. Use our practice section to better prepare yourself for the multiple  programming challenges  that take place through-out the month on CodeChef.   Here is where you can show off your  computer programming  skills. Take part in our 10 day long monthly  coding contest  and the shorter format Cook-off  coding contest . Put yourself up for recognition and win great prizes. Our  programming contests  have prizes worth up to INR 20,000 (for Indian Community), $700 (for Global Community) and lots more CodeChef goodies up for grabs.  "}